{
  "buildings": [
    {
      "id": 1,
      "name": "The Shard",
      "height": "310",
      "floors": "87",
      "yearbuilt": "2012",
      "primaryuse": "Mixed",
      "location": "Southwark",
      "notes": "Tallest building in the UK",
      "description": "The Shard, also referred to as the Shard of Glass, Shard London Bridge and formerly London Bridge Tower, is a 72-storey skyscraper, designed by the Italian architect Renzo Piano, in Southwark, London, that forms part of the Shard Quarter development. Standing 309.6 metres (1,016 feet) high, the Shard is the tallest building in the United Kingdom, and the seventh-tallest building in Europe. It is also the second-tallest free-standing structure in the United Kingdom, after the concrete tower of the Emley Moor transmitting station. It replaced Southwark Towers, a 24-storey office block built on the site in 1975.",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/07/The_Shard_from_the_Sky_Garden_2015.jpg/240px-The_Shard_from_the_Sky_Garden_2015.jpg"
    },
    {
      "id": 2,
      "name": "22 Bishopsgate",
      "height": "278",
      "floors": "62",
      "yearbuilt": "2019",
      "primaryuse": "Office",
      "location": "City of London",
      "notes": "Tallest building in the City of London",
      "description": "22 Bishopsgate, also known as Twentytwo, is a commercial skyscraper in London, United Kingdom. Completed in 2020, it occupies a prominent site in Bishopsgate, in the City of London financial district, and stands at 278 m (912 ft) tall with 62 storeys. The project replaces an earlier plan for a 288 m (945 ft) tower named The Pinnacle, on which construction was started in 2008 but suspended in 2012 following the Great Recession, with only the concrete core of the first seven storeys. The structure was later subjected to a re-design, out of which it became known by its postal address, 22 Bishopsgate.",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/22BishopsgateDec19.png/240px-22BishopsgateDec19.png"
    },
    {
      "id": 3,
      "name": "One Canada Square",
      "height": "235",
      "floors": "50",
      "yearbuilt": "1991",
      "primaryuse": "Office",
      "location": "Canary Wharf",
      "notes": "Tallest building in the Canary Wharf business district",
      "description": "One Canada Square is a skyscraper in Canary Wharf, London. It was completed in 1991 and is the third tallest building in the United Kingdom at 770 feet (235 m) above ground level containing 50 storeys. One Canada Square was designed by César Pelli with Adamson Associates and Frederick Gibberd Coombes. The design and shape are based on earlier precedents buildings that include Brookfield Place and Elizabeth Tower. The building is clad with durable stainless steel. One of the predominant features of the building is the pyramid roof, which contains a flashing aircraft warning light, a rare feature for buildings in the United Kingdom. The distinctive pyramid pinnacle is 800 feet (240 m) above sea level.",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/London_MMB_S6_Canary_Wharf.jpg/250px-London_MMB_S6_Canary_Wharf.jpg"
    },
    {
      "id": 4,
      "name": "Landmark Pinnacle",
      "height": "233",
      "floors": "75",
      "yearbuilt": "2020",
      "primaryuse": "Residential",
      "location": "Canary Wharf",
      "description": "Landmark Pinnacle is a 233-metre (764 ft) skyscraper under construction by developer Chalegrove Properties in Marsh Wall on the Isle of Dogs, London, United Kingdom. It is set to be the tallest residential building in Europe and will have more habitable floors than any other building in Europe. The development was formerly known as City Pride, the same name as the public house it replaces, before a name change in 2016.",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Landmark_Pinnacle_December_2020.png/240px-Landmark_Pinnacle_December_2020.png"
    },
    {
      "id": 5,
      "name": "Heron Tower",
      "height": "230",
      "floors": "46",
      "yearbuilt": "2011",
      "primaryuse": "Office",
      "location": "City of London",
      "notes": "Only 202 m at roof height, but includes a 28 m (92 ft) mast",
      "description": "Salesforce Tower, 110 Bishopsgate (formerly Heron Tower) is a commercial skyscraper in London. It stands 230 metres (755 ft) tall including its 28-metre (92 ft) mast making it the second tallest building in the City of London financial district and the fifth tallest in Greater London and the United Kingdom, after the Shard in Southwark and One Canada Square at Canary Wharf. 110 Bishopsgate is located on Bishopsgate and is bordered by Camomile Street, Outwich Street and Houndsditch.",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Heron_Tower%2C_Bishopsgate%2C_London.JPG/220px-Heron_Tower%2C_Bishopsgate%2C_London.JPG"
    },
    {
      "id": 6,
      "name": "122 Leadenhall Street",
      "height": "225",
      "floors": "46",
      "yearbuilt": "2014",
      "primaryuse": "Office",
      "location": "City of London",
      "notes": "Nicknamed 'The Cheesegrate'",
      "description": "122 Leadenhall Street, also known as the Leadenhall Building, is a skyscraper in London that is 225 metres (738 ft) tall. It opened in July 2014 and was designed by Rogers Stirk Harbour + Partners; it is known informally as The Cheesegrater because of its distinctive wedge shape similar to that of the kitchen utensil with the same name. It is one of a number of tall buildings recently completed or under construction in the City of London financial district, including 20 Fenchurch Street, 22 Bishopsgate, and The Scalpel.",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Cheesegrater_and_Gherkin.jpg/240px-Cheesegrater_and_Gherkin.jpg"
    },
    {
      "id": 7,
      "name": "Newfoundland",
      "height": "220",
      "floors": "60",
      "yearbuilt": "2019",
      "primaryuse": "Residential",
      "location": "Canary Wharf",
      "description": "The Newfoundland is a 220-metre (720 ft) residential skyscraper currently under development between Westferry Road and Bank Street on the Isle of Dogs, London. South Quay Properties, Ltd., a subsidiary of Canary Wharf Group, submitted a planning application to Tower Hamlets in June 2013 for the erection of a 58-storey and linked 2-storey building for residential use, along with some retail uses and car parking at a location bounded by Park Place, Westferry Road and Heron Quay Road. The building was designed by architects Horden Cherry Lee and WSP structural engineers, and is scheduled to be open for rent in February 2021.",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/NewfoundlandCanaryWharf.jpg/300px-NewfoundlandCanaryWharf.jpg"
    }
  ]
}
